# Groupby : Split, Apply and Combine
---------------
   Groupby is one of the important operations in data analysis.It includes three steps - <br>
         
   <ul>
    <li><b>Splitting</b></li>
    <li><b>Applying</b>
        <ul>
            <li>Aggregation</li>
            <li>Transformation</li>
            <li>Filterting</li>
        </ul>
    </li>
    <li><b>Combine</b></li>
   </ul>
        
   Groupby property is grouped the data according the column supplied to the function.In the following example
 you can see the i have grouped the dataframe df by its team.

In [28]:
import pandas as pd
import numpy as np

In [22]:
d={
    'team':["India","New zealand","Australia","India",
            "India","New zealand","Australia","India",
            "New zealand","Australia","New zealand","Australia"],
     'Run':[330,230,300,180,200,250,190,400,340,290,390,333],
     "Match":[2,4,2,1,5,6,3,2,5,3,1,1],
     "Year":['2012','2012','2012','2012','2013','2013','2013','2013','2014','2014','2014','2014']
  }
df=pd.DataFrame(d)
df

    Match  Run  Year         team
0       2  330  2012        India
1       4  230  2012  New zealand
2       2  300  2012    Australia
3       1  180  2012        India
4       5  200  2013        India
5       6  250  2013  New zealand
6       3  190  2013    Australia
7       2  400  2013        India
8       5  340  2014  New zealand
9       3  290  2014    Australia
10      1  390  2014  New zealand
11      1  333  2014    Australia

    groupby() function will return an object.we can imagine that every group is pointing to its dataframe.

In [4]:
g=df.groupby('team')
g

In [14]:
for team,teamdata in g:
    print(team)
    print("-"*10)
    print(teamdata)
    print("-"*35)

Australia
----------
    Match  Run  Year       team
2       2  300  2012  Australia
6       3  190  2013  Australia
9       3  290  2014  Australia
11      1  333  2014  Australia
-----------------------------------
India
----------
   Match  Run  Year   team
0      2  330  2012  India
3      1  180  2012  India
4      5  200  2013  India
7      2  400  2013  India
-----------------------------------
New zealand
----------
    Match  Run  Year         team
1       4  230  2012  New zealand
5       6  250  2013  New zealand
8       5  340  2014  New zealand
10      1  390  2014  New zealand
-----------------------------------

 **get_group('group name') :**  <br>
  It will return dataframe of particular group

In [16]:
g.get_group('India')

   Match  Run  Year
0      2  330  2012
3      1  180  2012
4      5  200  2013
7      2  400  2013

In [17]:
g.get_group('Australia')

    Match  Run  Year
2       2  300  2012
6       3  190  2013
9       3  290  2014
11      1  333  2014

     We can also perform the operations which we were applying in dataframe.This only difference here you get is 
     your operation will be applied to all of group and return the result of all groups.

In [18]:
g.min()

             Match  Run  Year
team
Australia        1  190  2012
India            1  180  2012
New zealand      1  230  2012

In [20]:
g.mean()

             Match     Run     Year
team
Australia     2.25  278.25  2013.25
India         2.50  277.50  2012.50
New zealand   4.00  302.50  2013.25

In [30]:
g_yr=df.groupby('Year')
g_yr['Run'].agg([np.min,np.max,np.mean,np.sum,np.std])

      amin  amax    mean   sum        std
Year
2012   180   330  260.00  1040  67.823300
2013   190   400  260.00  1040  96.953597
2014   290   390  338.25  1353  40.974586